Diplom_5/src/DataProcessors/ВКМ_ЗаполнениеГрафикаРаботы/ВКМ_ЗаполнениеГрафикаРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_ЗаполнениеГрафикаРаботы</name>
  <attributes>
    <name>ВКМ_ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВКМ_ГрафикиРаботы</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Diplom_5/src/InformationRegisters/ВКМ_ГрафикиРаботы/ВКМ_ГрафикиРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ГрафикиРаботы</name>
  <resources>
    <name>ВКМ_Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВКМ_ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВКМ_ГрафикиРаботы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Diplom_5/src/DataProcessors/ВКМ_ЗаполнениеГрафикаРаботы/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

Процедура ВКМ_ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, ВыходныеДни) Экспорт 
	
	Набор = РегистрыСведений.ВКМ_ГрафикиРаботы.СоздатьНаборЗаписей();
	Набор.Отбор.ВКМ_ГрафикРаботы.Установить(ВКМ_ГрафикРаботы);
	
	Набор.Прочитать();
	
	ЧислоСекундВСутках = 86400;
	
	ПеременннаяДата = ДатаНачала;
	Для Количество = 0 По Набор.Количество()-1 Цикл
		
		Запись = Набор[Количество];
		Если Запись.ВКМ_Дата < ДатаНачала Тогда
			Продолжить;
		ИначеЕсли Запись.ВКМ_Дата = ПеременннаяДата Тогда
			Если Найти(ВыходныеДни, Строка(ДеньНедели(ПеременннаяДата))) Тогда
				Запись.ВКМ_Значение = 0;
			Иначе
				Запись.ВКМ_Значение = 8;
			КонецЕсли;
			ПеременннаяДата = ПеременннаяДата + ЧислоСекундВСутках;
		Иначе
			Пока ПеременннаяДата < Мин(Запись.ВКМ_Дата, ДатаОкончания) Цикл
				НоваяЗапись = Набор.Добавить();
				НоваяЗапись.ВКМ_ГрафикРаботы = ВКМ_ГрафикРаботы;
				НоваяЗапись.ВКМ_Дата = ПеременннаяДата;
				Если Найти(ВыходныеДни, Строка(ДеньНедели(ПеременннаяДата))) Тогда
					НоваяЗапись.ВКМ_Значение = 0;
				Иначе
					НоваяЗапись.ВКМ_Значение = 8;
				КонецЕсли;
				ПеременннаяДата = ПеременннаяДата + ЧислоСекундВСутках;
			КонецЦикла;
			Если Запись.ВКМ_Дата > ДатаОкончания Тогда
				Прервать;
			Иначе
				Если Найти(ВыходныеДни, Строка(ДеньНедели(ПеременннаяДата))) Тогда
					Запись.ВКМ_Значение = 0;
				Иначе
					Запись.ВКМ_Значение = 8;
				КонецЕсли;
			КонецЕсли;
			ПеременннаяДата = ПеременннаяДата + ЧислоСекундВСутках;
		КонецЕсли;
	КонецЦикла;
	Набор.Записать();
	
	Пока ПеременннаяДата <= ДатаОкончания Цикл
		Запись = Набор.Добавить();
		Запись.ВКМ_ГрафикРаботы = ВКМ_ГрафикРаботы;
		Запись.ВКМ_Дата = ПеременннаяДата;
		Если Найти(ВыходныеДни, Строка(ДеньНедели(ПеременннаяДата))) Тогда
			Запись.ВКМ_Значение = 0;
		Иначе
			Запись.ВКМ_Значение = 8;
		КонецЕсли;
		ПеременннаяДата = ПеременннаяДата + ЧислоСекундВСутках;
	КонецЦикла;
	Набор.Записать(); 
	
КонецПроцедуры

#КонецОбласти
#КонецЕсли
